src/cf/Catalogs/КонтактныеЛицаПартнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛицаПартнеров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииСвязи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияСвязи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Взаимодействия</Name>
					<Comment>Взаимодействия</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ВладелецБизнеса</Name>
					<Comment>Владелец бизнеса</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Заказчик</Name>
					<Comment>Заказчик</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Ключевой</Name>
					<Comment>Ключевой контакт</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ЛичныеИнтересы</Name>
					<Comment>Личные интересы контактного лица</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_НапоминатьОДнеРождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ОтписалсяОтEmailРассылок</Name>
					<Comment>Отписался от Email рассылок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Противник</Name>
					<Comment>Противник</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ПроцентЗаполненностиКИ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ПроцентЗаполненностиПортрет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Прочее</Name>
					<Comment>Прочее</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_РольКонтактногоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_Состояние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Спонсор</Name>
					<Comment>Спонсор</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Сторонник</Name>
					<Comment>Сторонник</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ТипОтношенийПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_УчаствуетВАнкетировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Фотография</Name>
					<Comment>Фотография клиента частное лицо</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеровПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпCoMagicID</Name>
					<Comment>Идентификатор контакта в системе CoMagic</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпПользовательДляПереключенияЗвонков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогГражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогСобственник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСклонятьФамилию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CRM_ОсновнойДляСвязи</Name>
							<Comment>Основной вид контактной информации для связи</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолиКонтактногоЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольКонтактногоЛица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CRM_ДополнительнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CRM_ДополнительнаяИнформация</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CRM_КлючевыеСобытия</Name>
					<Comment>Ключевые события контакта</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСобытия</Name>
							<Comment>Вид ключевого события</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ВидыКлючевыхСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Comment>Дата ключевого события</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НапоминатьОСобытии</Name>
							<Comment>Напоминать о ключевом событии</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокОповещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_ПериодичностьОповещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/CRM_Состояние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_Состояние</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уволен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноНеРаботает</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/КомпанияЧастноеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>КомпанияЧастноеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Компания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/КонтактныеЛицаПартнеров/Forms/CRM_ФормаБыстрогоВвода/Ext/Form/Module.bsl
#Область Служебные_Процедуры_и_Функции

&НаСервере
Функция ПреобразоватьСписокПолейВСтроку(СоответствиеПолей)
	
	Результат = "";
	Для Каждого Элемент Из СоответствиеПолей Цикл
		
		Значение = Элемент.Значение;
		Если ПустаяСтрока(Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = Результат + ?(Результат = "", "", Символы.ПС) + 
			Элемент.Представление + "=" + СтрЗаменить(Значение, Символы.ПС, Символы.ПС + Символы.Таб);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПроверкаЗаполнения()
	
	ОшибокНет = Истина;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено наименование'"), , "Наименование");
		ОшибокНет = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Клиент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен клиент'"), , "Клиент");
		ОшибокНет = Ложь;
	КонецЕсли;

	Возврат ОшибокНет;
	
КонецФункции

&НаСервере
Функция СоздатьНовоеКонтактноеЛицо()
	
	НовоеКонтактноеЛицо = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();
	НовоеКонтактноеЛицо.Владелец		= Клиент;
	НовоеКонтактноеЛицо.CRM_Имя			= Имя;
	НовоеКонтактноеЛицо.CRM_Отчество	= Отчество;
	НовоеКонтактноеЛицо.CRM_Фамилия		= Фамилия;
	НовоеКонтактноеЛицо.CRM_Должность	= Должность;
	НовоеКонтактноеЛицо.Наименование	= Наименование;
	НовоеКонтактноеЛицо.Автор = Пользователи.АвторизованныйПользователь();
	НовоеКонтактноеЛицо.ДатаРегистрацииСвязи = ТекущаяДатаСеанса();
	
	Если ЭтоКонтактныйКлиент И ЗначениеЗаполнено(КонтактныйКлиент) Тогда
		
		НовоеКонтактноеЛицо.CRM_Состояние			= Состояние;
		НовоеКонтактноеЛицо.CRM_РольКонтактногоЛица	= Роль;
		НовоеКонтактноеЛицо.Пол	= КонтактныйКлиент.Пол;
		
		Для Каждого СтрокаТаблицы Из КонтактныйКлиент.КонтактнаяИнформация Цикл
			ТекТипКИ = Неопределено;
			ТекВидКИ = Неопределено;
			Если СтрокаТаблицы.Вид = Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонЧастногоЛица Тогда
				ТекТипКИ = СтрокаТаблицы.Тип;
				ТекВидКИ = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица;
			ИначеЕсли СтрокаТаблицы.Вид = Справочники.ВидыКонтактнойИнформации.EmailПартнера Тогда
				ТекТипКИ = СтрокаТаблицы.Тип;
				ТекВидКИ = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
			ИначеЕсли СтрокаТаблицы.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера Тогда
				ТекТипКИ = СтрокаТаблицы.Тип;
				ТекВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекТипКИ) И ЗначениеЗаполнено(ТекВидКИ) Тогда
				НоваяСтрока = НовоеКонтактноеЛицо.КонтактнаяИнформация.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы,, "Вид");
				НоваяСтрока.Вид = ТекВидКИ;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если ЗначениеЗаполнено(ВидТелефонаКонтактногоЛица) И ЗначениеЗаполнено(ТелефонКонтактногоЛица) Тогда
			КодСтраныСтрока 		= ?(ЗначениеЗаполнено(КодСтраныКонтактногоЛица),"+"+КодСтраныКонтактногоЛица,"");
			НовыйКонтакт 			= НовоеКонтактноеЛицо.КонтактнаяИнформация.Добавить();
			СписокПолей 			= Новый СписокЗначений;
			СписокПолей.Добавить(КодСтраныСтрока,			"КодСтраны");
			СписокПолей.Добавить(КодГородаКонтактногоЛица,	"КодГорода");
			СписокПолей.Добавить(ТелефонКонтактногоЛица,	"НомерТелефона");
			СписокПолей.Добавить(ДобНомерКонтактногоЛица,	"Добавочный");
			СписокПолей.Добавить("",						"Комментарий");
			НовыйКонтакт.ЗначенияПолей = ПреобразоватьСписокПолейВСтроку(СписокПолей);
			
			НовыйКонтакт.Вид	= ВидТелефонаКонтактногоЛица;
			НовыйКонтакт.Тип	= ВидТелефонаКонтактногоЛица.Тип;
			
			Представление = СокрЛП(КодСтраныСтрока);
			Если Не ПустаяСтрока(КодГородаКонтактногоЛица) Тогда
				Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + "(" + СокрЛП(КодГородаКонтактногоЛица) + ")";
			КонецЕсли;
			Если Не ПустаяСтрока(ТелефонКонтактногоЛица) Тогда
				Представление = Представление + ?(ПустаяСтрока(Представление), "", " ") + СокрЛП(ТелефонКонтактногоЛица);
			КонецЕсли;
			Если НЕ ПустаяСтрока(ДобНомерКонтактногоЛица) Тогда
				Представление = Представление + ?(ПустаяСтрока(Представление), "", ", ") + "доб. " + СокрЛП(ДобНомерКонтактногоЛица);
			КонецЕсли;
			
			НовыйКонтакт.Представление 			= Представление;
			НовыйКонтакт.НомерТелефона 			= Представление;
			НовыйКонтакт.НомерТелефонаБезКодов 	= СокрЛП(ТелефонКонтактногоЛица);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВидEmailКонтактногоЛица) И ЗначениеЗаполнено(EmailКонтактногоЛица) Тогда
			НовыйКонтакт 				= НовоеКонтактноеЛицо.КонтактнаяИнформация.Добавить();
			НовыйКонтакт.Вид			= ВидEmailКонтактногоЛица;
			НовыйКонтакт.Тип			= ВидEmailКонтактногоЛица.Тип;
	 		НовыйКонтакт.Представление 	= СокрЛП(EmailКонтактногоЛица);

			Попытка
				Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(EmailКонтактногоЛица);
			Исключение
				СообщениеОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				Возврат Неопределено;
			КонецПопытки;
			
			Если Результат.Количество() > 0 Тогда
				НовыйКонтакт.АдресЭП = Результат[0].Адрес;
				
				Поз = Найти(НовыйКонтакт.АдресЭП, "@");
				Если Поз <> 0 Тогда
					НовыйКонтакт.ДоменноеИмяСервера = Сред(НовыйКонтакт.АдресЭП, Поз+1);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		НовоеКонтактноеЛицо.Записать();
		Если ЭтоКонтактныйКлиент И ЗначениеЗаполнено(КонтактныйКлиент) Тогда
			РегистрыСведений.CRM_СвязиФизЛицСКонтактнымиЛицамиПартнеров.ЗаписатьФизЛицо(НовоеКонтактноеЛицо.Ссылка, КонтактныйКлиент);
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат НовоеКонтактноеЛицо.Ссылка;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоФизЛицу()
	
	Фамилия			= КонтактныйКлиент.CRM_Фамилия;
	Имя				= КонтактныйКлиент.CRM_Имя;
	Отчество		= КонтактныйКлиент.CRM_Отчество;
	Наименование	= КонтактныйКлиент.Наименование;
	
	Для Каждого СтрокаТаблицы Из КонтактныйКлиент.КонтактнаяИнформация Цикл
		ТекТипКИ = Неопределено;
		ТекВидКИ = Неопределено;
		Если СтрокаТаблицы.Вид = Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонЧастногоЛица Тогда
			МобТелефон = СтрокаТаблицы.Представление;
		ИначеЕсли СтрокаТаблицы.Вид = Справочники.ВидыКонтактнойИнформации.EmailПартнера Тогда
			РабочийЕмайл = СтрокаТаблицы.Представление;
		ИначеЕсли СтрокаТаблицы.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера Тогда
			РабочийТелефон = СтрокаТаблицы.Представление;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_Событий_Форм

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПараметрыНового") Тогда
		Если Параметры.ПараметрыНового.Свойство("ЭтоКонтактныйКлиент") И Параметры.ПараметрыНового.ЭтоКонтактныйКлиент = Истина Тогда
			Заголовок						= НСтр("ru = 'Регистрация новой связи с юридическим лицом'");
			Элементы.ГруппаСтраниц.ТекущаяСтраница	= Элементы.СтраницаКонтактногоКлиента;
			ЭтоКонтактныйКлиент						= Параметры.ПараметрыНового.ЭтоКонтактныйКлиент;
			КонтактныйКлиент						= Параметры.ПараметрыНового.КонтактныйКлиент;
			Состояние								= Перечисления.CRM_Состояние.Работает;
			ЗаполнитьПоФизЛицу();
		Иначе
			Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.СтраницаКонтактногоЛица;
			Наименование			= Параметры.ПараметрыНового.Наименование;
			ВидEmailКонтактногоЛица	= Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
			EmailКонтактногоЛица	= Параметры.ПараметрыНового.АдресПочты;
		КонецЕсли;
	КонецЕсли;
	// +Софтфон
	Если Параметры.Свойство("Основание") И ТипЗнч(Параметры.Основание) = Тип("Структура") Тогда
		Если Параметры.Основание.Свойство("Интерес") Тогда
			сфпИнтерес = Параметры.Основание.Интерес;
		КонецЕсли;	
		Клиент = ?(Параметры.Основание.Свойство("Владелец"),Параметры.Основание.Владелец, ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
		Если Параметры.Основание.Свойство("НомерТелефона") Тогда
			Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(Параметры.Основание.НомерТелефона);		
			СтруктураНомера = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Телефон);
			Если Найти(СтруктураНомера.КодГорода, "9") = 1 Тогда
				ВидТелефонаКонтактногоЛица = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица");
			Иначе	
				ВидТелефонаКонтактногоЛица = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица");
			КонецЕсли;			
			Если ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
				КодГородаКонтактногоЛица = СтруктураНомера.КодГорода;
			КонецЕсли;	
			Если ЗначениеЗаполнено(СтруктураНомера.КодСтраны) Тогда
				КодСтраныКонтактногоЛица = СтруктураНомера.КодСтраны;
			КонецЕсли;				
			ТелефонКонтактногоЛица = СтруктураНомера.НомерТелефона;
		КонецЕсли;					
	КонецЕсли;		
	// +Софтфон
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(сфпИнтерес) Тогда
		ВидТелефонаКонтактногоЛицаПриИзменении(Неопределено);
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти

#Область Обработчики_Команд_Формы

&НаКлиенте
Процедура ЗарегистрироватьКонтактноеЛицо(Команда)
	
	Если НЕ ПроверкаЗаполнения() Тогда
		Возврат;
	КонецЕсли;
	
	НовоеКонтактноеЛицо = СоздатьНовоеКонтактноеЛицо();
	
	Если ЗначениеЗаполнено(НовоеКонтактноеЛицо) Тогда 
		Если ЭтоКонтактныйКлиент Тогда
			Оповестить("Создан новый контактный клиент",НовоеКонтактноеЛицо);
		Иначе
			Оповестить("Создано новое контактное лицо",НовоеКонтактноеЛицо);
		КонецЕсли;
		// +Софтфон		
		Если ЗначениеЗаполнено(сфпИнтерес) Тогда
			Оповестить("СозданКонтактДляИнтереса", Новый Структура("сфпИнтерес, Контакт", сфпИнтерес, НовоеКонтактноеЛицо));
		КонецЕсли;			
		// -Софтфон		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_Элементов_Формы

&НаКлиенте
Процедура ВидТелефонаКонтактногоЛицаПриИзменении(Элемент)
	
	Элементы.ГруппаТелефонКонтактногоЛица.Доступность = ЗначениеЗаполнено(ВидТелефонаКонтактногоЛица);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидEmailКонтактногоЛицаПриИзменении(Элемент)
	
	Элементы.EmailКонтактногоЛица.Доступность = ЗначениеЗаполнено(ВидEmailКонтактногоЛица);
	
КонецПроцедуры

&НаКлиенте
Процедура EmailКонтактногоЛицаПриИзменении(Элемент)
	
	РезультатПроверки = CRM_ОбщегоНазначенияКлиентСервер.АнализАдресаЭП(СокрЛП(Элемент.ТекстРедактирования));
	Если РезультатПроверки.КодОшибки<>0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатПроверки.Сообщение, , Элемент.Имя);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	
	Наименование = СокрЛП(?(ЗначениеЗаполнено(Фамилия),СокрЛП(Фамилия) + " ", "")
						+ ?(ЗначениеЗаполнено(Имя),СокрЛП(Имя) + " ", "")
						+ ?(ЗначениеЗаполнено(Отчество),СокрЛП(Отчество), ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	Наименование = СокрЛП(?(ЗначениеЗаполнено(Фамилия),СокрЛП(Фамилия) + " ", "")
						+ ?(ЗначениеЗаполнено(Имя),СокрЛП(Имя) + " ", "")
						+ ?(ЗначениеЗаполнено(Отчество),СокрЛП(Отчество), ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	
	Наименование = СокрЛП(?(ЗначениеЗаполнено(Фамилия),СокрЛП(Фамилия) + " ", "")
						+ ?(ЗначениеЗаполнено(Имя),СокрЛП(Имя) + " ", "")
						+ ?(ЗначениеЗаполнено(Отчество),СокрЛП(Отчество), ""));
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЭтоКонтактныйКлиент Тогда
		СтандартнаяОбработка = Ложь;
		
		СтруктураОтбора = Новый Структура("ЮрФизЛицо", ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.Компания"));
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
		
		ОткрытьФорму("Справочник.Партнеры.ФормаВыбора", ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
